Revit 2027 API
ExportLayerTable.GetAvaliableLayerModifierTypes Method
 Gets all the avaliable layer modifier types for the layer key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ModifierType> GetAvaliableLayerModifierTypes(
	Document document,
	ExportLayerKey exportLayerKey
)
Public Shared Function GetAvaliableLayerModifierTypes (
	document As Document,
	exportLayerKey As ExportLayerKey
) As IList(Of ModifierType)
public:
static IList<ModifierType>^ GetAvaliableLayerModifierTypes(
	Document^ document,
	ExportLayerKey^ exportLayerKey
)
static member GetAvaliableLayerModifierTypes :
        document : Document *
        exportLayerKey : ExportLayerKey -> IList<ModifierType>
Parameters
document Document
 A Revit document to retrieve avaliable layer modifier types from.
exportLayerKey ExportLayerKey
 The export layer key to specify wich category and subCategory will be used to get the layer modifier types.
Return Value
IList<ModifierType>
 The layer modifier types.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace